Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetCustomObjectType Method
 Gets custom object type name from an existing object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetCustomObjectType()
Public Function GetCustomObjectType As String
Return Value
Type: String
Type name string, empty string if type is not set.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace